micropython/micropython/ports/stm32/usb.c
typedef struct _pyb_usb_mode_table_t {
    uint8_t usbd_mode;
    uint16_t qst;
    const char *deprecated_str;
    uint16_t default_pid;
} pyb_usb_mode_table_t;

// These are all the modes supported by USBD_SelectMode.
// Note: there are some names (eg CDC, VCP+VCP) which are supported for backwards compatibility.
STATIC const pyb_usb_mode_table_t pyb_usb_mode_table[] = {
    { USBD_MODE_CDC, MP_QSTR_VCP, "CDC", MICROPY_HW_USB_PID_CDC },
    { USBD_MODE_MSC, MP_QSTR_MSC, NULL, MICROPY_HW_USB_PID_MSC },
    { USBD_MODE_CDC_MSC, MP_QSTR_VCP_plus_MSC, "CDC+MSC", MICROPY_HW_USB_PID_CDC_MSC },
    { USBD_MODE_CDC_HID, MP_QSTR_VCP_plus_HID, "CDC+HID", MICROPY_HW_USB_PID_CDC_HID },
    { USBD_MODE_CDC_MSC_HID, MP_QSTR_VCP_plus_MSC_plus_HID, NULL, MICROPY_HW_USB_PID_CDC_MSC_HID },

    #if MICROPY_HW_USB_CDC_NUM >= 2
    { USBD_MODE_CDC2, MP_QSTR_2xVCP, "VCP+VCP", MICROPY_HW_USB_PID_CDC2 },
    { USBD_MODE_CDC2_MSC, MP_QSTR_2xVCP_plus_MSC, "VCP+VCP+MSC", MICROPY_HW_USB_PID_CDC2_MSC },
    { USBD_MODE_CDC2_MSC_HID, MP_QSTR_2xVCP_plus_MSC_plus_HID, NULL, MICROPY_HW_USB_PID_CDC2_MSC_HID },
    #endif

    #if MICROPY_HW_USB_CDC_NUM >= 3
    { USBD_MODE_CDC3, MP_QSTR_3xVCP, NULL, MICROPY_HW_USB_PID_CDC3 },
    { USBD_MODE_CDC3_MSC, MP_QSTR_3xVCP_plus_MSC, NULL, MICROPY_HW_USB_PID_CDC3_MSC },
    { USBD_MODE_CDC3_MSC_HID, MP_QSTR_3xVCP_plus_MSC_plus_HID, NULL, MICROPY_HW_USB_PID_CDC3_MSC_HID },
    #endif
};

STATIC mp_obj_t pyb_usb_mode(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum {
        ARG_mode, ARG_port, ARG_vid, ARG_pid,
        #if MICROPY_HW_USB_MSC
        ARG_msc,
        #endif
        #if MICROPY_HW_USB_HID
        ARG_hid,
        #endif
        #if USBD_SUPPORT_HS_MODE
        ARG_high_speed
        #endif
    };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_port, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_vid, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = MICROPY_HW_USB_VID} },
        { MP_QSTR_pid, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        #if MICROPY_HW_USB_MSC
        { MP_QSTR_msc, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_PTR(&mp_const_empty_tuple_obj)} },
        #endif
        #if MICROPY_HW_USB_HID
        { MP_QSTR_hid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_PTR(&pyb_usb_hid_mouse_obj)} },
        #endif
        #if USBD_SUPPORT_HS_MODE
        { MP_QSTR_high_speed, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        #endif
    };

    // fetch the current usb mode -> pyb.usb_mode()
    if (n_args == 0) {
        #if defined(USE_HOST_MODE)
        return MP_OBJ_NEW_QSTR(MP_QSTR_host);
        #else
        uint8_t mode = USBD_GetMode(&usb_device.usbd_cdc_msc_hid_state) & USBD_MODE_IFACE_MASK;
        for (size_t i = 0; i < MP_ARRAY_SIZE(pyb_usb_mode_table); ++i) {
            const pyb_usb_mode_table_t *m = &pyb_usb_mode_table[i];
            if (mode == m->usbd_mode) {
                return MP_OBJ_NEW_QSTR(m->qst);
            }
        }
        return mp_const_none;
        #endif
    }

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // record the fact that the usb has been explicitly configured
    pyb_usb_flags |= PYB_USB_FLAG_USB_MODE_CALLED;

    // check if user wants to disable the USB
    if (args[ARG_mode].u_obj == mp_const_none) {
        // disable usb
        pyb_usb_dev_deinit();
        return mp_const_none;
    }

    // get mode string
    const char *mode_str = mp_obj_str_get_str(args[ARG_mode].u_obj);

    #if defined(USE_HOST_MODE)

    // hardware configured for USB host mode

    if (strcmp(mode_str, "host") == 0) {
        pyb_usb_host_init();
    } else {
        goto bad_mode;
    }

    #else

    // hardware configured for USB device mode

    // get the VID, PID and USB mode
    // note: PID=-1 means select PID based on mode
    uint16_t vid = args[ARG_vid].u_int;
    mp_int_t pid = args[ARG_pid].u_int;
    uint8_t mode = 0;
    for (size_t i = 0; i < MP_ARRAY_SIZE(pyb_usb_mode_table); ++i) {
        const pyb_usb_mode_table_t *m = &pyb_usb_mode_table[i];
        if (strcmp(mode_str, qstr_str(m->qst)) == 0
            || (m->deprecated_str != NULL && strcmp(mode_str, m->deprecated_str) == 0)) {
            if (pid == -1) {
                pid = m->default_pid;
            }
            mode = m->usbd_mode;
            break;
        }
    }
    if (mode == 0) {
        goto bad_mode;
    }

    // Get MSC logical units
    size_t msc_n = 0;
    const void *msc_unit[USBD_MSC_MAX_LUN];
    #if MICROPY_HW_USB_MSC
    if (mode & USBD_MODE_IFACE_MSC) {
        mp_obj_t *items;
        mp_obj_get_array(args[ARG_msc].u_obj, &msc_n, &items);
        if (msc_n > USBD_MSC_MAX_LUN) {
            mp_raise_ValueError(MP_ERROR_TEXT("too many logical units"));
        }
        for (size_t i = 0; i < msc_n; ++i) {
            const mp_obj_type_t *type = mp_obj_get_type(items[i]);
            if (type == &pyb_flash_type
                #if MICROPY_HW_ENABLE_SDCARD
                || type == &pyb_sdcard_type
                #endif
                #if MICROPY_HW_ENABLE_MMCARD
                || type == &pyb_mmcard_type
                #endif
                ) {
                msc_unit[i] = type;
            } else {
                mp_raise_ValueError(MP_ERROR_TEXT("unsupported logical unit"));
            }
        }
    }
    #endif

    // get hid info if user selected such a mode
    USBD_HID_ModeInfoTypeDef hid_info;
    #if MICROPY_HW_USB_HID
    if (mode & USBD_MODE_IFACE_HID) {
        mp_obj_t *items;
        mp_obj_get_array_fixed_n(args[ARG_hid].u_obj, 5, &items);
        hid_info.subclass = mp_obj_get_int(items[0]);
        hid_info.protocol = mp_obj_get_int(items[1]);
        hid_info.max_packet_len = mp_obj_get_int(items[2]);
        hid_info.polling_interval = mp_obj_get_int(items[3]);
        mp_buffer_info_t bufinfo;
        mp_get_buffer_raise(items[4], &bufinfo, MP_BUFFER_READ);
        hid_info.report_desc = bufinfo.buf;
        hid_info.report_desc_len = bufinfo.len;

